Repository: morgk2/alifi
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Continue with Facebook
ar: تسجيل الدخول عبر فيسبوك

source: Continue with Google
ar: تسجيل الدخول عبر جوجل

source: Continue with Apple
ar: تسجيل الدخول عبر أبل

source: Continue as Guest
ar: الدخول كضيف

source: Report a problem
ar: الإبلاغ عن مشكلة

source: By clicking continue, you agree to our
ar: بالنقر على متابعة، أنت توافق على

source: Terms of Service
ar: شروط الخدمة

source: and
ar: و

source: Privacy Policy
ar: سياسة الخصوصية

source: AI pet assistant
ar: مساعد الحيوانات الأليفة الذكي

source: Type your message...
ar: اكتب رسالتك...

source: alifi
ar: أليفي

source: Good afternoon, user!
ar: مساء الخير، مستخدم!

source: Loading nearby pets...
ar: جاري تحميل الحيوانات الأليفة القريبة...

source: Lost pets nearby
ar: الحيوانات الأليفة المفقودة القريبة

source: Recent lost pets
ar: الحيوانات الأليفة المفقودة حديثاً

source: LOST
ar: مفقود

source: years old
ar: سنوات

source: Description
ar: الوصف

source: Price
ar: السعر

source: Affiliate Partnership
ar: شراكة تابعة

# affiliatePartnershipDescription
source: This product is available through our affiliate partnership with AliExpress. When you make a purchase through these links, you support our app at no additional cost to you. This helps us maintain and improve our services.
ar: هذا المنتج متاح من خلال شراكتنا التابعة مع علي إكسبرس. عند الشراء من خلال هذه الروابط، تدعم تطبيقنا دون تكلفة إضافية عليك. هذا يساعدنا في الحفاظ على خدماتنا وتحسينها.

source: Report Found
ar: الإبلاغ عن العثور

source: Open in Maps
ar: فتح في الخرائط

source: Contact
ar: اتصال

source: Pet marked as found successfully!
ar: تم تمييز الحيوان الأليف كأنه تم العثور عليه بنجاح!

# errorMarkingPetAsFound
source: Error marking pet as found: {error}
ar: خطأ في تمييز الحيوان الأليف كأنه تم العثور عليه: {error}

source: Are you sure?
ar: هل أنت متأكد؟

# thisWillPostYourMissingPetReport
source: This will post your missing pet report to the community.
ar: سيتم نشر تقرير حيوانك الأليف المفقود في المجتمع.

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: Search
ar: بحث

source: Close
ar: إغلاق

source: OK
ar: موافق

source: PROCEED
ar: متابعة

source: Enter custom amount
ar: أدخل مبلغ مخصص

source: Location Services Disabled
ar: خدمات الموقع معطلة

# pleaseEnableLocationServices
source: Please enable location services or enter your location manually.
ar: يرجى تفعيل خدمات الموقع أو إدخال موقعك يدوياً.

source: Enter Manually
ar: إدخال يدوي

source: Open Settings
ar: فتح الإعدادات

source: Location Permission Required
ar: إذن الموقع مطلوب

# locationPermissionRequiredDescription
source: Location permission is required to use this feature. Please enable it in your device settings.
ar: إذن الموقع مطلوب لاستخدام هذه الميزة. يرجى تفعيله في إعدادات جهازك.

source: Enter Your Location
ar: أدخل موقعك

# locationSetTo
source: Location set to: {address}
ar: تم تعيين الموقع إلى: {address}

source: Report Missing Pet
ar: الإبلاغ عن حيوان أليف مفقود

source: Add Your Business
ar: أضف عملك

# pleaseLoginToReportMissingPet
source: Please login to report a missing pet
ar: يرجى تسجيل الدخول للإبلاغ عن حيوان مفقود

# thisVetIsAlreadyInDatabase
source: This vet is already in the database
ar: هذا الطبيب البيطري موجود بالفعل في قاعدة البيانات

# thisStoreIsAlreadyInDatabase
source: This store is already in the database
ar: هذا المتجر موجود بالفعل في قاعدة البيانات

source: Added vet clinic to map
ar: تمت إضافة العيادة البيطرية إلى الخريطة

source: Added pet store to map
ar: تمت إضافة متجر الحيوانات الأليفة إلى الخريطة

# errorAddingBusiness
source: Error adding business: {error}
ar: خطأ في إضافة العمل: {error}

source: Migrate Locations
ar: ترحيل المواقع

# migrateLocationsDescription
source: This will migrate all existing pet locations to the new format. This process cannot be undone.
ar: سيتم ترحيل جميع مواقع الحيوانات الأليفة الموجودة إلى التنسيق الجديد. لا يمكن التراجع عن هذه العملية.

source: Migration Complete
ar: اكتمل الترحيل

# migrationCompleteDescription
source: All locations have been successfully migrated to the new format.
ar: تم ترحيل جميع المواقع بنجاح إلى التنسيق الجديد.

source: Migration Failed
ar: فشل الترحيل

# errorDuringMigration
source: Error during migration: {error}
ar: خطأ أثناء الترحيل: {error}

source: Admin Dashboard
ar: لوحة تحكم المدير

source: Coming soon!
ar: قريباً!

source: Select Language
ar: اختر اللغة

source: Settings
ar: الإعدادات

source: Language
ar: اللغة

source: Notifications
ar: الإشعارات

source: Privacy
ar: الخصوصية

source: Help
ar: المساعدة

source: About
ar: حول

source: Logout
ar: تسجيل الخروج

source: Debug Info
ar: معلومات التصحيح

source: AuthService initialized
ar: تم تهيئة خدمة المصادقة

source: AuthService loading
ar: جاري تحميل خدمة المصادقة

source: AuthService authenticated
ar: تم المصادقة في خدمة المصادقة

source: AuthService user
ar: مستخدم خدمة المصادقة

source: Firebase user
ar: مستخدم Firebase

source: Guest mode
ar: وضع الضيف

source: Force Sign Out
ar: إجبار تسجيل الخروج

source: Signed out of all services
ar: تم تسجيل الخروج من جميع الخدمات

# failedToGetDebugInfo
source: Failed to get debug info: {error}
ar: فشل في الحصول على معلومات التصحيح: {error}

source: Error
ar: خطأ

source: Last seen
ar: آخر ظهور

# physicalPetIdFor
source: Physical Pet ID for {petName}
ar: هوية الحيوان الأليف المادية لـ {petName}

# hiAskMeAboutPetAdvice
source: Hi! ask me about any pet advice, and I'll do my best to help you, and your little one!
ar: مرحباً! اسألني عن أي نصيحة للحيوانات الأليفة، وسأبذل قصارى جهدي لمساعدتك ومساعدة صغيرك!

# errorGettingLocation
source: Error getting location: {error}
ar: خطأ في الحصول على الموقع: {error}

# errorFindingLocation
source: Error finding location: {error}
ar: خطأ في العثور على الموقع: {error}

source: vet
ar: طبيب بيطري

source: store
ar: متجر

source: vet clinic
ar: عيادة بيطرية

source: Pet Store
ar: متجر الحيوانات الأليفة

source: My Pets
ar: حيواناتي الأليفة

source: Add Pet
ar: إضافة حيوان أليف

source: Edit Pet
ar: تعديل الحيوان الأليف

source: Pet Name
ar: اسم الحيوان الأليف

source: Pet Type
ar: نوع الحيوان الأليف

source: Pet Breed
ar: سلالة الحيوان الأليف

source: Pet Age
ar: عمر الحيوان الأليف

source: Pet Weight
ar: وزن الحيوان الأليف

source: Pet Color
ar: لون الحيوان الأليف

source: Pet Gender
ar: جنس الحيوان الأليف

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Save
ar: حفظ

source: Delete
ar: حذف

source: Delete Pet
ar: حذف الحيوان الأليف

# deletePetConfirmation
source: Are you sure you want to delete this pet?
ar: هل أنت متأكد من حذف هذا الحيوان الأليف؟

source: Pet deleted successfully
ar: تم حذف الحيوان الأليف بنجاح

source: Pet saved successfully
ar: تم حفظ الحيوان الأليف بنجاح

# errorSavingPet
source: Error saving pet: {error}
ar: خطأ في حفظ الحيوان الأليف: {error}

# errorDeletingPet
source: Error deleting pet: {error}
ar: خطأ في حذف الحيوان الأليف: {error}

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

source: Take Photo
ar: التقاط صورة

source: Choose from Gallery
ar: اختيار من المعرض

source: No image selected
ar: لم يتم اختيار صورة

source: Loading...
ar: جاري التحميل...

source: No pets found
ar: لم يتم العثور على حيوانات أليفة

source: Add your first pet
ar: أضف حيوانك الأليف الأول

source: Pet Details
ar: تفاصيل الحيوان الأليف

source: Pet Photos
ar: صور الحيوان الأليف

# petMedicalHistory
source: Medical History
ar: التاريخ الطبي

# petVaccinations
source: Vaccinations
ar: التطعيمات

# petMedications
source: Medications
ar: الأدوية

# petAllergies
source: Allergies
ar: الحساسية

# petBehavior
source: Behavior
ar: السلوك

# petDiet
source: Diet
ar: النظام الغذائي

# petExercise
source: Exercise
ar: التمارين

# petGrooming
source: Grooming
ar: التنظيف

# petTraining
source: Training
ar: التدريب

# petInsurance
source: Insurance
ar: التأمين

# petMicrochip
source: Microchip
ar: الرقاقة الإلكترونية

# petLicense
source: License
ar: الترخيص

# petRegistration
source: Registration
ar: التسجيل

# petEmergencyContact
source: Emergency Contact
ar: جهة الاتصال في الطوارئ

# petVet
source: Veterinarian
ar: الطبيب البيطري

# petGroomer
source: Groomer
ar: المصفف

# petTrainer
source: Trainer
ar: المدرب

source: Pet Sitter
ar: جليس الحيوانات الأليفة

source: Pet Walker
ar: ممشى الحيوانات الأليفة

# petBoarding
source: Boarding
ar: الإقامة

# petDaycare
source: Daycare
ar: الحضانة

# petAdoption
source: Adoption
ar: التبني

# petFoster
source: Foster
ar: الرعاية المؤقتة

# petRescue
source: Rescue
ar: الإنقاذ

# petShelter
source: Shelter
ar: الملجأ

# petBreeder
source: Breeder
ar: المربي

# petClinic
source: Clinic
ar: العيادة

# petHospital
source: Hospital
ar: المستشفى

# petPharmacy
source: Pharmacy
ar: الصيدلية

# petFood
source: Food
ar: الطعام

# petToys
source: Toys
ar: الألعاب

# petBeds
source: Beds
ar: الأسرّة

# petCrates
source: Crates
ar: الصناديق

# petCarriers
source: Carriers
ar: الحاويات

# petCollars
source: Collars
ar: الأطواق

# petLeashes
source: Leashes
ar: الأحزمة

# petHarnesses
source: Harnesses
ar: الشدادات

# petTags
source: Tags
ar: العلامات

# petClothing
source: Clothing
ar: الملابس

# petShoes
source: Shoes
ar: الأحذية

# petAccessories
source: Accessories
ar: الملحقات

# petSupplies
source: Supplies
ar: المستلزمات

# petEquipment
source: Equipment
ar: المعدات

# petTools
source: Tools
ar: الأدوات

# petMedicine
source: Medicine
ar: الدواء

# petVitamins
source: Vitamins
ar: الفيتامينات

# petSupplements
source: Supplements
ar: المكملات

# petTreats
source: Treats
ar: المكافآت

# petSnacks
source: Snacks
ar: الوجبات الخفيفة

# petWater
source: Water
ar: الماء

# petBowl
source: Bowl
ar: الوعاء

# petFeeder
source: Feeder
ar: المغذي

# petFountain
source: Fountain
ar: النافورة

# petLitter
source: Litter
ar: الفراش

# petLitterBox
source: Litter Box
ar: صندوق الفضلات

# petScratchingPost
source: Scratching Post
ar: عمود الخدش

# petTree
source: Cat Tree
ar: شجرة القطط

# petCage
source: Cage
ar: القفص

# petAquarium
source: Aquarium
ar: الحوض

# petTerrarium
source: Terrarium
ar: التراريوم

# petHutch
source: Hutch
ar: الخيمة

# petCoop
source: Coop
ar: القن

# petStable
source: Stable
ar: الإسطبل

# petBarn
source: Barn
ar: الحظيرة

# petKennel
source: Kennel
ar: الكنل

# petRun
source: Run
ar: الملعب

# petFence
source: Fence
ar: السور

# petGate
source: Gate
ar: البوابة

source: Pet Door
ar: باب الحيوان الأليف

# petRamp
source: Ramp
ar: المنحدر

# petStairs
source: Stairs
ar: السلالم

# petElevator
source: Elevator
ar: المصعد

# petEscalator
source: Escalator
ar: السلم المتحرك

# petSlide
source: Slide
ar: الزلاقة

# petSwing
source: Swing
ar: الأرجوحة

# petSeesaw
source: Seesaw
ar: المرجوحة

# petMerryGoRound
source: Merry-go-round
ar: دولاب الهواء

# petFerrisWheel
source: Ferris Wheel
ar: عجلة فيريس

# petRollerCoaster
source: Roller Coaster
ar: سكة الحديد المعلقة

# petCarousel
source: Carousel
ar: المرجوحة الدوارة

# petBumperCars
source: Bumper Cars
ar: سيارات التصادم

# petGoKarts
source: Go-karts
ar: الدراجات النارية الصغيرة

# petMiniGolf
source: Mini Golf
ar: الجولف المصغر

# petBowling
source: Bowling
ar: البولينج

# petArcade
source: Arcade
ar: ألعاب الفيديو

# petCinema
source: Cinema
ar: السينما

# petTheater
source: Theater
ar: المسرح

# petConcert
source: Concert
ar: الحفل الموسيقي

# petFestival
source: Festival
ar: المهرجان

# petCarnival
source: Carnival
ar: الكرنفال

# petCircus
source: Circus
ar: السيرك

# petZoo
source: Zoo
ar: الحديقة الحيوانية

# petMuseum
source: Museum
ar: المتحف

# petLibrary
source: Library
ar: المكتبة

# petSchool
source: School
ar: المدرسة

# petUniversity
source: University
ar: الجامعة

# petCollege
source: College
ar: الكلية

# petAcademy
source: Academy
ar: الأكاديمية

# petInstitute
source: Institute
ar: المعهد

# petCenter
source: Center
ar: المركز

# petFoundation
source: Foundation
ar: المؤسسة

# petAssociation
source: Association
ar: الجمعية

# petSociety
source: Society
ar: المجتمع

# petClub
source: Club
ar: النادي

# petGroup
source: Group
ar: المجموعة

# petTeam
source: Team
ar: الفريق

# petSquad
source: Squad
ar: الفرقة

# petGang
source: Gang
ar: العصابة

# petPack
source: Pack
ar: القطيع

# petHerd
source: Herd
ar: القطيع

# petFlock
source: Flock
ar: السرب

# petSwarm
source: Swarm
ar: السرب

# petColony
source: Colony
ar: المستعمرة

# petNest
source: Nest
ar: العش

# petDen
source: Den
ar: الجحر

# petLair
source: Lair
ar: الوكر

# petCave
source: Cave
ar: الكهف

# petBurrow
source: Burrow
ar: الجحر

# petHole
source: Hole
ar: الحفرة

# petTunnel
source: Tunnel
ar: النفق

# petMaze
source: Maze
ar: المتاهة

# petLabyrinth
source: Labyrinth
ar: المتاهة

# petPuzzle
source: Puzzle
ar: اللغز

# petGame
source: Game
ar: اللعبة

# petPlay
source: Play
ar: اللعب

# petFun
source: Fun
ar: المرح

# petHappy
source: Happy
ar: سعيد

# petSad
source: Sad
ar: حزين

# petAngry
source: Angry
ar: غاضب

# petScared
source: Scared
ar: خائف

# petExcited
source: Excited
ar: متحمس

# petCalm
source: Calm
ar: هادئ

# petSleepy
source: Sleepy
ar: نعسان

# petHungry
source: Hungry
ar: جائع

# petThirsty
source: Thirsty
ar: عطشان

# petTired
source: Tired
ar: متعب

# petEnergetic
source: Energetic
ar: نشط

# petLazy
source: Lazy
ar: كسول

# petActive
source: Active
ar: نشط

# petQuiet
source: Quiet
ar: هادئ

# petLoud
source: Loud
ar: صاخب

# petNoisy
source: Noisy
ar: صاخب

# petSilent
source: Silent
ar: صامت

# petTalkative
source: Talkative
ar: ثرثار

# petShy
source: Shy
ar: خجول

# petFriendly
source: Friendly
ar: ودود

# petAggressive
source: Aggressive
ar: عدواني

# petGentle
source: Gentle
ar: لطيف

# petRough
source: Rough
ar: خشن

# petSoft
source: Soft
ar: ناعم

# petHard
source: Hard
ar: قاسي

# petSmooth
source: Smooth
ar: أملس

# petWarm
source: Warm
ar: دافئ

# petCold
source: Cold
ar: بارد

# petHot
source: Hot
ar: ساخن

# petCool
source: Cool
ar: بارد

# petWet
source: Wet
ar: رطب

# petDry
source: Dry
ar: جاف

# petClean
source: Clean
ar: نظيف

# petDirty
source: Dirty
ar: قذر

# petFresh
source: Fresh
ar: طازج

# petStale
source: Stale
ar: قديم

# petNew
source: New
ar: جديد

# petOld
source: Old
ar: قديم

# petYoung
source: Young
ar: شاب

# petBaby
source: Baby
ar: طفل

# petPuppy
source: Puppy
ar: جرو

# petKitten
source: Kitten
ar: هريرة

# petCub
source: Cub
ar: شبل

# petChick
source: Chick
ar: فرخ

# petFoal
source: Foal
ar: مهر

# petCalf
source: Calf
ar: عجل

# petLamb
source: Lamb
ar: خروف

# petKid
source: Kid
ar: جدي

# petPiglet
source: Piglet
ar: خنزير صغير

# petDuckling
source: Duckling
ar: بطة صغيرة

# petGosling
source: Gosling
ar: إوزة صغيرة

# petCygnets
source: Cygnets
ar: بجعات صغيرة

# petTadpole
source: Tadpole
ar: شرغوف

# petFry
source: Fry
ar: زريعة

# petFingerling
source: Fingerling
ar: إصبعية

# petSmolt
source: Smolt
ar: سمولت

# petParr
source: Parr
ar: بار

# petAlevin
source: Alevin
ar: ألفين

# petSpawn
source: Spawn
ar: بيض

# petRoe
source: Roe
ar: بيض السمك

# petCaviar
source: Caviar
ar: كافيار

# petEgg
source: Egg
ar: بيضة

# petLarva
source: Larva
ar: يرقة

# petPupa
source: Pupa
ar: شرنقة

# petCaterpillar
source: Caterpillar
ar: يرقة

# petChrysalis
source: Chrysalis
ar: شرنقة

# petCocoon
source: Cocoon
ar: شرنقة

# petMaggot
source: Maggot
ar: يرقة

# petGrub
source: Grub
ar: يرقة

# petWorm
source: Worm
ar: دودة

# petSlug
source: Slug
ar: بزاقة

# petSnail
source: Snail
ar: حلزون

# petClam
source: Clam
ar: محار

# petOyster
source: Oyster
ar: محار

# petMussel
source: Mussel
ar: بلح البحر

# petScallop
source: Scallop
ar: إسكالوب

# petAbalone
source: Abalone
ar: أذن البحر

# petConch
source: Conch
ar: صدفة

# petWhelk
source: Whelk
ar: بوق البحر

# petPeriwinkle
source: Periwinkle
ar: بريونكل

# petLimpets
source: Limpets
ar: برنقيل

# petBarnacles
source: Barnacles
ar: برنقيل

# petCrabs
source: Crabs
ar: سرطان البحر

# petLobsters
source: Lobsters
ar: كركند

# petShrimp
source: Shrimp
ar: روبيان

# petPrawns
source: Prawns
ar: جمبري

# petCrayfish
source: Crayfish
ar: سرطان النهر

# petKrill
source: Krill
ar: كريل

# petCopepods
source: Copepods
ar: قشريات

# petAmphipods
source: Amphipods
ar: براغيث الماء

# petIsopods
source: Isopods
ar: حشرات متساوية الأرجل

# petOstracods
source: Ostracods
ar: صدفيات

# petBranchiopods
source: Branchiopods
ar: قشريات فرعيات

# petRemipedes
source: Remipedes
ar: حشرات مجدافية

# petCephalocarids
source: Cephalocarids
ar: رؤوسية

# petMalacostracans
source: Malacostracans
ar: قشريات لينة

# petMaxillopods
source: Maxillopods
ar: فكيات

# petThecostracans
source: Thecostracans
ar: قشريات محرقة

# petTantulocarids
source: Tantulocarids
ar: تانتولوكاريد

# petMystacocarids
source: Mystacocarids
ar: مستاكوكاريد

# petBranchiurans
source: Branchiurans
ar: خيشوميات

# petPentastomids
source: Pentastomids
ar: خماسية الفم

# petTardigrades
source: Tardigrades
ar: بطيئات المشية

# petRotifers
source: Rotifers
ar: دوارات

# petGastrotrichs
source: Gastrotrichs
ar: معويات الشعر

# petKinorhynchs
source: Kinorhynchs
ar: حرشفيات الفم

# petLoriciferans
source: Loriciferans
ar: حاملات الدرع

# petPriapulids
source: Priapulids
ar: قضيبيات

# petNematodes
source: Nematodes
ar: ديدان خيطية

# petNematomorphs
source: Nematomorphs
ar: ديدان شعرية

# petAcanthocephalans
source: Acanthocephalans
ar: ديدان شوكية الرأس

# petEntoprocts
source: Entoprocts
ar: داخليات الشرج

# petCycliophorans
source: Cycliophorans
ar: دائرية الفم

# petMicrognathozoans
source: Micrognathozoans
ar: صغار الفك

# petGnathostomulids
source: Gnathostomulids
ar: فكيات الفم

# petPlatyhelminthes
source: Platyhelminthes
ar: ديدان مسطحة

# petCestodes
source: Cestodes
ar: ديدان شريطية

# petTrematodes
source: Trematodes
ar: ديدان ماصة

# petMonogeneans
source: Monogeneans
ar: ديدان وحيدة الجيل

# petTurbellarians
source: Turbellarians
ar: ديدان مهدبة

# petCatenulids
source: Catenulids
ar: ديدان سلسلية

# petRhabditophorans
source: Rhabditophorans
ar: ديدان عصوية

# petNeodermata
source: Neodermata
ar: جلد جديد

# petAspidogastrea
source: Aspidogastrea
ar: درعيات البطن

# petDigenea
source: Digenea
ar: ثنائية الجيل

# petMonopisthocotylea
source: Monopisthocotylea
ar: وحيدة الممص

# petPolyopisthocotylea
source: Polyopisthocotylea
ar: متعددة الممص

# petGyrocotylidea
source: Gyrocotylidea
ar: دائرية الأوراق

# petAmphilinidea
source: Amphilinidea
ar: مزدوجة الخط

# petCaryophyllidea
source: Caryophyllidea
ar: قرنفلية

# petDiphyllobothriidea
source: Diphyllobothriidea
ar: ثنائية الفص

# petHaplobothriidea
source: Haplobothriidea
ar: بسيطة الفص

# petBothriocephalidea
source: Bothriocephalidea
ar: رؤوسية الفص

# petLitobothriidea
source: Litobothriidea
ar: حجرية الفص

# petLecanicephalidea
source: Lecanicephalidea
ar: رؤوسية الكأس

# petRhinebothriidea
source: Rhinebothriidea
ar: رؤوسية الأنف

# petTetraphyllidea
source: Tetraphyllidea
ar: رباعية الأوراق

# petOnchoproteocephalidea
source: Onchoproteocephalidea
ar: رؤوسية الخطاف

# petProteocephalidea
source: Proteocephalidea
ar: رؤوسية البروتيوس

# petTrypanorhyncha
source: Trypanorhyncha
ar: مثقوبة الخطاف

# petDiphyllidea
source: Diphyllidea
ar: ثنائية الأوراق

# petSpathebothriidea
source: Spathebothriidea
ar: غمدية الأوراق
